tutorials/multiphase/vof/vofDyMSolver/ras/floatingObject/constant/dynamicMeshDict-MOTIONSOLVER
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolverLibs   ("librigidBodyMeshMotionSolver.so" "libfvMotionSolvers.so");

solver             rigidBodyMeshMotionSolver;

rigidBodyMeshMotionSolverCoeffs
{
    report          on;

    outputControl
    {         
        outputControl timeStep; // Possible options: timeStep, outputTime, adjustableTime, runTime, clockTime, cpuTime 
        outputInterval       1; // Only used with timeStep, outputTime
        writeInterval        1; // Only used with adjustableTime, runTime, clockTime, cpuTime
    }

    meshSolver
    {
        solver displacementLaplacian;

        displacementLaplacianCoeffs
        {
            diffusivity inverseDistance (floatingObject);
        }
    }
    solver
    {
        type Newmark;
    }

    accelerationRelaxation 0.7;

    bodies
    {
        floatingObject
        {
            type            cuboid;
            parent          root;

            // Cuboid mass
            mass            15;
            L               (0.3 0.2 0.5);
            centreOfMass    (0 0 0.25);
            transform       (1 0 0 0 1 0 0 0 1) (0.5 0.45 0.1);

            joint
            {
                type            composite;
                joints
                (
                    {
                        type Py;
                    }
                    {
                        type Ry;
                    }
                );
            }

            patches         (floatingObject);
        }
    }
}


// ************************************************************************* //
